node {
  name: "x"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "model/Conv1/Conv2D"
  op: "Conv2D"
  input: "x"
  input: "model/Conv1/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "model/bn_Conv1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/Conv1/Conv2D"
  input: "model/bn_Conv1/ReadVariableOp/resource"
  input: "model/bn_Conv1/ReadVariableOp_1/resource"
  input: "model/bn_Conv1/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/bn_Conv1/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/Conv1_relu/Relu6"
  op: "Relu6"
  input: "model/bn_Conv1/FusedBatchNormV3"
}
node {
  name: "model/expanded_conv_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/Conv1_relu/Relu6"
  input: "model/expanded_conv_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/expanded_conv_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/expanded_conv_depthwise/depthwise"
  input: "model/expanded_conv_depthwise_BN/ReadVariableOp/resource"
  input: "model/expanded_conv_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/expanded_conv_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/expanded_conv_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/expanded_conv_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/expanded_conv_project/Conv2D"
  op: "Conv2D"
  input: "model/expanded_conv_depthwise_relu/Relu6"
  input: "model/expanded_conv_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/expanded_conv_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/expanded_conv_project/Conv2D"
  input: "model/expanded_conv_project_BN/ReadVariableOp/resource"
  input: "model/expanded_conv_project_BN/ReadVariableOp_1/resource"
  input: "model/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/expanded_conv_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_1_expand/Conv2D"
  op: "Conv2D"
  input: "model/expanded_conv_project_BN/FusedBatchNormV3"
  input: "model/block_1_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_1_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_1_expand/Conv2D"
  input: "model/block_1_expand_BN/ReadVariableOp/resource"
  input: "model/block_1_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_1_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_1_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_1_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_1_pad/Pad"
  op: "Pad"
  input: "model/block_1_expand_relu/Relu6"
  input: "model/block_1_pad/Pad/paddings"
}
node {
  name: "model/block_1_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_1_pad/Pad"
  input: "model/block_1_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "model/block_1_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_1_depthwise/depthwise"
  input: "model/block_1_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_1_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_1_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_1_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_1_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_1_project/Conv2D"
  op: "Conv2D"
  input: "model/block_1_depthwise_relu/Relu6"
  input: "model/block_1_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_1_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_1_project/Conv2D"
  input: "model/block_1_project_BN/ReadVariableOp/resource"
  input: "model/block_1_project_BN/ReadVariableOp_1/resource"
  input: "model/block_1_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_1_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_2_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_1_project_BN/FusedBatchNormV3"
  input: "model/block_2_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_2_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_2_expand/Conv2D"
  input: "model/block_2_expand_BN/ReadVariableOp/resource"
  input: "model/block_2_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_2_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_2_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_2_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_2_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_2_expand_relu/Relu6"
  input: "model/block_2_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_2_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_2_depthwise/depthwise"
  input: "model/block_2_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_2_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_2_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_2_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_2_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_2_project/Conv2D"
  op: "Conv2D"
  input: "model/block_2_depthwise_relu/Relu6"
  input: "model/block_2_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_2_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_2_project/Conv2D"
  input: "model/block_2_project_BN/ReadVariableOp/resource"
  input: "model/block_2_project_BN/ReadVariableOp_1/resource"
  input: "model/block_2_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_2_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_2_add/add"
  op: "AddV2"
  input: "model/block_1_project_BN/FusedBatchNormV3"
  input: "model/block_2_project_BN/FusedBatchNormV3"
}
node {
  name: "model/block_3_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_2_add/add"
  input: "model/block_3_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_3_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_3_expand/Conv2D"
  input: "model/block_3_expand_BN/ReadVariableOp/resource"
  input: "model/block_3_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_3_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_3_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_3_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_3_pad/Pad"
  op: "Pad"
  input: "model/block_3_expand_relu/Relu6"
  input: "model/block_3_pad/Pad/paddings"
}
node {
  name: "model/block_3_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_3_pad/Pad"
  input: "model/block_3_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "model/block_3_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_3_depthwise/depthwise"
  input: "model/block_3_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_3_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_3_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_3_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_3_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_3_project/Conv2D"
  op: "Conv2D"
  input: "model/block_3_depthwise_relu/Relu6"
  input: "model/block_3_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_3_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_3_project/Conv2D"
  input: "model/block_3_project_BN/ReadVariableOp/resource"
  input: "model/block_3_project_BN/ReadVariableOp_1/resource"
  input: "model/block_3_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_3_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_4_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_3_project_BN/FusedBatchNormV3"
  input: "model/block_4_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_4_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_4_expand/Conv2D"
  input: "model/block_4_expand_BN/ReadVariableOp/resource"
  input: "model/block_4_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_4_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_4_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_4_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_4_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_4_expand_relu/Relu6"
  input: "model/block_4_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_4_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_4_depthwise/depthwise"
  input: "model/block_4_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_4_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_4_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_4_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_4_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_4_project/Conv2D"
  op: "Conv2D"
  input: "model/block_4_depthwise_relu/Relu6"
  input: "model/block_4_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_4_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_4_project/Conv2D"
  input: "model/block_4_project_BN/ReadVariableOp/resource"
  input: "model/block_4_project_BN/ReadVariableOp_1/resource"
  input: "model/block_4_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_4_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_4_add/add"
  op: "AddV2"
  input: "model/block_3_project_BN/FusedBatchNormV3"
  input: "model/block_4_project_BN/FusedBatchNormV3"
}
node {
  name: "model/block_5_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_4_add/add"
  input: "model/block_5_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_5_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_5_expand/Conv2D"
  input: "model/block_5_expand_BN/ReadVariableOp/resource"
  input: "model/block_5_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_5_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_5_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_5_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_5_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_5_expand_relu/Relu6"
  input: "model/block_5_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_5_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_5_depthwise/depthwise"
  input: "model/block_5_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_5_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_5_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_5_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_5_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_5_project/Conv2D"
  op: "Conv2D"
  input: "model/block_5_depthwise_relu/Relu6"
  input: "model/block_5_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_5_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_5_project/Conv2D"
  input: "model/block_5_project_BN/ReadVariableOp/resource"
  input: "model/block_5_project_BN/ReadVariableOp_1/resource"
  input: "model/block_5_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_5_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_5_add/add"
  op: "AddV2"
  input: "model/block_4_add/add"
  input: "model/block_5_project_BN/FusedBatchNormV3"
}
node {
  name: "model/block_6_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_5_add/add"
  input: "model/block_6_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_6_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_6_expand/Conv2D"
  input: "model/block_6_expand_BN/ReadVariableOp/resource"
  input: "model/block_6_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_6_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_6_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_6_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_6_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_6_pad/Pad"
  op: "Pad"
  input: "model/block_6_expand_relu/Relu6"
  input: "model/block_6_pad/Pad/paddings"
}
node {
  name: "model/block_6_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_6_pad/Pad"
  input: "model/block_6_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "model/block_6_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_6_depthwise/depthwise"
  input: "model/block_6_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_6_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_6_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_6_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_6_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_6_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_6_project/Conv2D"
  op: "Conv2D"
  input: "model/block_6_depthwise_relu/Relu6"
  input: "model/block_6_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_6_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_6_project/Conv2D"
  input: "model/block_6_project_BN/ReadVariableOp/resource"
  input: "model/block_6_project_BN/ReadVariableOp_1/resource"
  input: "model/block_6_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_6_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_7_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_6_project_BN/FusedBatchNormV3"
  input: "model/block_7_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_7_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_7_expand/Conv2D"
  input: "model/block_7_expand_BN/ReadVariableOp/resource"
  input: "model/block_7_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_7_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_7_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_7_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_7_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_7_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_7_expand_relu/Relu6"
  input: "model/block_7_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_7_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_7_depthwise/depthwise"
  input: "model/block_7_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_7_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_7_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_7_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_7_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_7_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_7_project/Conv2D"
  op: "Conv2D"
  input: "model/block_7_depthwise_relu/Relu6"
  input: "model/block_7_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_7_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_7_project/Conv2D"
  input: "model/block_7_project_BN/ReadVariableOp/resource"
  input: "model/block_7_project_BN/ReadVariableOp_1/resource"
  input: "model/block_7_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_7_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_7_add/add"
  op: "AddV2"
  input: "model/block_6_project_BN/FusedBatchNormV3"
  input: "model/block_7_project_BN/FusedBatchNormV3"
}
node {
  name: "model/block_8_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_7_add/add"
  input: "model/block_8_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_8_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_8_expand/Conv2D"
  input: "model/block_8_expand_BN/ReadVariableOp/resource"
  input: "model/block_8_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_8_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_8_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_8_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_8_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_8_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_8_expand_relu/Relu6"
  input: "model/block_8_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_8_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_8_depthwise/depthwise"
  input: "model/block_8_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_8_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_8_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_8_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_8_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_8_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_8_project/Conv2D"
  op: "Conv2D"
  input: "model/block_8_depthwise_relu/Relu6"
  input: "model/block_8_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_8_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_8_project/Conv2D"
  input: "model/block_8_project_BN/ReadVariableOp/resource"
  input: "model/block_8_project_BN/ReadVariableOp_1/resource"
  input: "model/block_8_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_8_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_8_add/add"
  op: "AddV2"
  input: "model/block_7_add/add"
  input: "model/block_8_project_BN/FusedBatchNormV3"
}
node {
  name: "model/block_9_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_8_add/add"
  input: "model/block_9_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_9_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_9_expand/Conv2D"
  input: "model/block_9_expand_BN/ReadVariableOp/resource"
  input: "model/block_9_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_9_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_9_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_9_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_9_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_9_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_9_expand_relu/Relu6"
  input: "model/block_9_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_9_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_9_depthwise/depthwise"
  input: "model/block_9_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_9_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_9_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_9_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_9_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_9_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_9_project/Conv2D"
  op: "Conv2D"
  input: "model/block_9_depthwise_relu/Relu6"
  input: "model/block_9_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_9_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_9_project/Conv2D"
  input: "model/block_9_project_BN/ReadVariableOp/resource"
  input: "model/block_9_project_BN/ReadVariableOp_1/resource"
  input: "model/block_9_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_9_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_9_add/add"
  op: "AddV2"
  input: "model/block_8_add/add"
  input: "model/block_9_project_BN/FusedBatchNormV3"
}
node {
  name: "model/block_10_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_9_add/add"
  input: "model/block_10_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_10_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_10_expand/Conv2D"
  input: "model/block_10_expand_BN/ReadVariableOp/resource"
  input: "model/block_10_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_10_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_10_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_10_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_10_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_10_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_10_expand_relu/Relu6"
  input: "model/block_10_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_10_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_10_depthwise/depthwise"
  input: "model/block_10_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_10_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_10_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_10_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_10_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_10_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_10_project/Conv2D"
  op: "Conv2D"
  input: "model/block_10_depthwise_relu/Relu6"
  input: "model/block_10_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_10_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_10_project/Conv2D"
  input: "model/block_10_project_BN/ReadVariableOp/resource"
  input: "model/block_10_project_BN/ReadVariableOp_1/resource"
  input: "model/block_10_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_10_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_11_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_10_project_BN/FusedBatchNormV3"
  input: "model/block_11_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_11_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_11_expand/Conv2D"
  input: "model/block_11_expand_BN/ReadVariableOp/resource"
  input: "model/block_11_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_11_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_11_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_11_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_11_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_11_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_11_expand_relu/Relu6"
  input: "model/block_11_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_11_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_11_depthwise/depthwise"
  input: "model/block_11_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_11_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_11_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_11_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_11_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_11_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_11_project/Conv2D"
  op: "Conv2D"
  input: "model/block_11_depthwise_relu/Relu6"
  input: "model/block_11_project/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_11_project_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_11_project/Conv2D"
  input: "model/block_11_project_BN/ReadVariableOp/resource"
  input: "model/block_11_project_BN/ReadVariableOp_1/resource"
  input: "model/block_11_project_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_11_project_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_11_add/add"
  op: "AddV2"
  input: "model/block_10_project_BN/FusedBatchNormV3"
  input: "model/block_11_project_BN/FusedBatchNormV3"
}
node {
  name: "model/block_12_expand/Conv2D"
  op: "Conv2D"
  input: "model/block_11_add/add"
  input: "model/block_12_expand/Conv2D/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_12_expand_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_12_expand/Conv2D"
  input: "model/block_12_expand_BN/ReadVariableOp/resource"
  input: "model/block_12_expand_BN/ReadVariableOp_1/resource"
  input: "model/block_12_expand_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_12_expand_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_12_expand_relu/Relu6"
  op: "Relu6"
  input: "model/block_12_expand_BN/FusedBatchNormV3"
}
node {
  name: "model/block_12_depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "model/block_12_expand_relu/Relu6"
  input: "model/block_12_depthwise/depthwise/ReadVariableOp/resource"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "model/block_12_depthwise_BN/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "model/block_12_depthwise/depthwise"
  input: "model/block_12_depthwise_BN/ReadVariableOp/resource"
  input: "model/block_12_depthwise_BN/ReadVariableOp_1/resource"
  input: "model/block_12_depthwise_BN/FusedBatchNormV3/ReadVariableOp/resource"
  input: "model/block_12_depthwise_BN/FusedBatchNormV3/ReadVariableOp_1/resource"
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "exponential_avg_factor"
    value {
      f: 1.0
    }
  }
}
node {
  name: "model/block_12_depthwise_relu/Relu6"
  op: "Relu6"
  input: "model/block_12_depthwise_BN/FusedBatchNormV3"
}
node {
  name: "model/block_12_project/Conv2D"
  op: "Conv2D"
